In [25]:
import pandas as pd
import numpy as np

## Day 9: Data Manipulation with Pandas - Hands On

### I. Create DataFrame

Kita bisa membuat dataframe dengan menuliskan dictionary seperti ini.

In [26]:
df = pd.DataFrame({
    "cust_id": ["A1", "A2", "A3", "A4", "A5"],
    "item_bought": [10,15,20,35,4],
    "city": ["Bandung", "Surabaya", "Bekasi", "Tangerang", "Denpasar"]
    })
df

  cust_id  item_bought       city
0      A1           10    Bandung
1      A2           15   Surabaya
2      A3           20     Bekasi
3      A4           35  Tangerang
4      A5            4   Denpasar

### II. Basic Pandas Operation

#### II.1. Basic

Basic overviews:

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   cust_id      5 non-null      object
 1   item_bought  5 non-null      int64
 2   city         5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [28]:
df.describe()

       item_bought
count     5.000000
mean     16.800000
std      11.777096
min       4.000000
25%      10.000000
50%      15.000000
75%      20.000000
max      35.000000

In [29]:
df.columns

Index(['cust_id', 'item_bought', 'city'], dtype='object')

Changing column names:

In [30]:
df.columns = ['cust_id', 'quantity', 'center_city']

In [31]:
df

  cust_id  quantity center_city
0      A1        10     Bandung
1      A2        15    Surabaya
2      A3        20      Bekasi
3      A4        35   Tangerang
4      A5         4    Denpasar

DataFrame shape (row, column)

In [32]:
df.shape

(5, 3)

In [33]:
row = df.shape[0]

In [34]:
column = df.shape[1]

Kita bisa mengubah `data type` dari sebuah kolom dengan `.astype`.

In [ ]:
df['quantity'] = df['quantity'].astype(float)

Maka akan terlihat bahwa kolom `quantity` sekarang menjadi dalam bentuk desimal (float).

#### II.2. Filtering

Selecting first few rows

In [35]:
df.head(2)

  cust_id  quantity center_city
0      A1        10     Bandung
1      A2        15    Surabaya

Selecting last rows

In [36]:
df.tail(3)

  cust_id  quantity center_city
2      A3        20      Bekasi
3      A4        35   Tangerang
4      A5         4    Denpasar

Selecting several columns

In [50]:
df_selected = df[['cust_id', 'quantity']]

In [51]:
df_selected

  cust_id  quantity
0      A1        10
1      A2        15
2      A3        20
3      A4        35
4      A5         4

In [52]:
## If you don't wish to create a new dataframe to store the selection, you can just
df[['cust_id', 'quantity']]

  cust_id  quantity
0      A1        10
1      A2        15
2      A3        20
3      A4        35
4      A5         4

Filtering rows that has quantity > 10

In [38]:
df[df['quantity']>10]

  cust_id  quantity center_city
1      A2        15    Surabaya
2      A3        20      Bekasi
3      A4        35   Tangerang

Filtering rows that has quantity >= 10 and whose center city is in Bandung / Surabaya.

In [40]:
df[(df['quantity'] >= 10) & (df['center_city'].isin(['Bandung', 'Surabaya']))]

  cust_id  quantity center_city
0      A1        10     Bandung
1      A2        15    Surabaya

Filtering with OR conditionals

In [63]:
df[(df["quantity"]>15) | (df["center_city"]!= "Tangerang")]

  cust_id  quantity center_city
0      A1        10     Bandung
1      A2        15    Surabaya
2      A3        20      Bekasi
3      A4        35   Tangerang
4      A5         4    Denpasar

Saving a filtered dataframe

In [41]:
df_more_than_10 = df[df['quantity']>10]

In [42]:
df_more_than_10

  cust_id  quantity center_city
1      A2        15    Surabaya
2      A3        20      Bekasi
3      A4        35   Tangerang

Restore the index

In [43]:
df_more_than_10 = df[df['quantity']>10].reset_index(drop = True)

In [44]:
df_more_than_10

  cust_id  quantity center_city
0      A2        15    Surabaya
1      A3        20      Bekasi
2      A4        35   Tangerang

Resample random rows >> run the cell below several times and you'll get different results.

In [49]:
df.sample(3)

  cust_id  quantity center_city
1      A2        15    Surabaya
0      A1        10     Bandung
2      A3        20      Bekasi

Selecting specific cell in the dataframe.

In [53]:
df

  cust_id  quantity center_city
0      A1        10     Bandung
1      A2        15    Surabaya
2      A3        20      Bekasi
3      A4        35   Tangerang
4      A5         4    Denpasar

In [55]:
### the quantity value of the 2nd index row
df.loc[2, 'quantity']

20

In [57]:
### the cell value of row index 3, and column index 2
df.iloc[3,2]

'Tangerang'

Selecting a range of cells

In [58]:
df.iloc[0:2,1:3]

## dari row 0 sampai sebelum row 2
## dari column 1 sampai sebelum row 3

   quantity center_city
0        10     Bandung
1        15    Surabaya

#### II.3. Reorder Columns

In [64]:
df

  cust_id  quantity center_city
0      A1        10     Bandung
1      A2        15    Surabaya
2      A3        20      Bekasi
3      A4        35   Tangerang
4      A5         4    Denpasar

In [65]:
df_reorder = df[['quantity', 'center_city', 'cust_id']]

In [66]:
df_reorder

   quantity center_city cust_id
0        10     Bandung      A1
1        15    Surabaya      A2
2        20      Bekasi      A3
3        35   Tangerang      A4
4         4    Denpasar      A5

### III. Group-By Data

This topic will further be discussed on Day 14.

In [67]:
iris = pd.read_csv("https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/639388c2cbc2120a14dcf466e85730eb8be498bb/iris.csv")

In [68]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

First, we can do `value_counts` to know how much species are there in the whole dataset.

In [69]:
iris['species'].value_counts()

versicolor    50
setosa        50
virginica     50
Name: species, dtype: int64

In [70]:
iris['species'].value_counts(normalize = True)

versicolor    0.333333
setosa        0.333333
virginica     0.333333
Name: species, dtype: float64

Next, we can groupby each species and find out a few important things!

In [71]:
iris.groupby('species').max() #to know the maximum length/width of the flowers in each species

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.8          4.4           1.9          0.6
versicolor           7.0          3.4           5.1          1.8
virginica            7.9          3.8           6.9          2.5

However, we can specify in details what we want to get from each columns, as such:

In [72]:
iris.groupby('species').agg({'sepal_length':'max', 'sepal_width':'mean',
                            'petal_length':['median', 'mean']})

           sepal_length sepal_width petal_length
                    max        mean       median   mean
species
setosa              5.8       3.418         1.50  1.464
versicolor          7.0       2.770         4.35  4.260
virginica           7.9       2.974         5.55  5.552

In [73]:
groupby_result = iris.groupby('species').agg({'sepal_length':'max', 'sepal_width':'mean',
                            'petal_length':['median', 'mean']})

Perhatikan! Index kolomnya itu 'multi-index', sehingga jika kita ingin memilih beberapa kolom saja, bentuknya harus seperti ini:

In [79]:
groupby_result[[('sepal_length','max'), ('petal_length', 'median')]]

           sepal_length petal_length
                    max       median
species
setosa              5.8         1.50
versicolor          7.0         4.35
virginica           7.9         5.55

### IV. Pivot Table

In [84]:
df = pd.DataFrame({'First Name': ['Aryan', 'Rohan', 'Riya', 'Yash', 'Siddhant', ],
                   'Last Name': ['Singh', 'Agarwal', 'Shah', 'Bhatia', 'Khanna'],
                   'Type': ['Full-time Employee', 'Intern', 'Full-time Employee', 
                            'Part-time Employee', 'Full-time Employee'],
                   'Department': ['Administration', 'Technical', 'Administration', 
                                  'Technical', 'Management'],
                   'YoE': [2, 3, 5, 7, 6],
                   'Salary': [20000, 5000, 10000, 10000, 20000]})

df

  First Name Last Name                Type      Department  YoE  Salary
0      Aryan     Singh  Full-time Employee  Administration    2   20000
1      Rohan   Agarwal              Intern       Technical    3    5000
2       Riya      Shah  Full-time Employee  Administration    5   10000
3       Yash    Bhatia  Part-time Employee       Technical    7   10000
4   Siddhant    Khanna  Full-time Employee      Management    6   20000

In [86]:
df.pivot_table(index = ['Type', 'Department'], values = 'Salary', 
              aggfunc = ['mean', 'count'])

                                    mean  count
                                  Salary Salary
Type               Department
Full-time Employee Administration  15000      2
                   Management      20000      1
Intern             Technical        5000      1
Part-time Employee Technical       10000      1

- Ada 2 orang yang 'Full Time Employee' di bagian 'Administration', gaji rata-rata mereka 15 000
- Ada 1 Intern, dan dia bekerja di bagian 'Technical', dan gaji rata-rata dia 5 000

In [87]:
df.pivot_table(index = ['Department', 'Type'], values = 'Salary', 
              aggfunc = ['mean', 'count'])

                                    mean  count
                                  Salary Salary
Department     Type
Administration Full-time Employee  15000      2
Management     Full-time Employee  20000      1
Technical      Intern               5000      1
               Part-time Employee  10000      1

Nah, kalau ditukar seperti ini Index-nya, maka yang kita lihat lebih dulu itu Departmentnya, bukan status ketenagakerjaannya.

Bagaimana kalau sekarang sintax kita seperti ini?

In [90]:
df.pivot_table(index = ['Department', 'Type'], columns = 'YoE', values = 'Salary')

YoE                                      2       3        5        6        7
Department     Type
Administration Full-time Employee  20000.0     NaN  10000.0      NaN      NaN
Management     Full-time Employee      NaN     NaN      NaN  20000.0      NaN
Technical      Intern                  NaN  5000.0      NaN      NaN      NaN
               Part-time Employee      NaN     NaN      NaN      NaN  10000.0

Sekarang, kita memiliki kolom 'YoE', artinya (Years of Experience). Dengan melihat tabel di atas, kita bisa belajar bahwa:
1. Ada ketimpangan gaji di Department Administration untuk para employee yang Full Time! Yang punya 2 tahun pengalaman dapet gaji 20 000, tapi yang punya 5 tahun pengalaman dapet gaji 10 000. 

2. Untuk department Management, si employee yang gajinya 20 000 itu memiliki 6 tahun pengalaman
3. dst

Pivot table memberikan kita kesempatan untuk melihat keadaan data secara 'garis besar', dan kita bisa memilih aspek-aspek apa saja yang ingin di highlight.

### V. Data Transformation

Kita bisa melakukan operasi kolom (atau baris) di dataframe menggunakan fitur `apply` pada `pandas`.

In [108]:
df = pd.DataFrame({ 'A': np.random.randint(low = 1, high = 10, size = 100), 
                   'B': np.random.randint(low = 10, high = 100, size = 100),
                   'C': np.random.randint(low = 20, high = 45, size = 100)
                  }, )
df

    A   B   C
0   2  58  27
1   1  68  27
2   8  92  29
3   7  93  22
4   6  45  21
.. ..  ..  ..
95  6  48  37
96  5  39  40
97  3  62  20
98  9  61  44
99  9  84  42

[100 rows x 3 columns]

Misal kita ingin membuat kolom baru, kolom 'D', dengan rumus sebagai berikut:
- D = 10 * A + (0.5 * B) - Akar(C)

Maka bagaimana agar kita cukup menulis 1 fungsi saja, dan langsung bisa menghitung seluruh baris di dataframe kita?

In [116]:
def custom_operation(a, b, c):
    return 10*a + (0.5)*b - np.sqrt(c)

In [119]:
df['D'] = df.apply(lambda x: custom_operation(x['A'], x['B'], x['C']), axis = 1)

In [121]:
### CEK Index 0 dan 95
print(10*2 + 0.5*58 - np.sqrt(27))
print(10*6 + 0.5*48 - np.sqrt(37))

43.80384757729337
77.91723746970177

In [120]:
df

    A   B   C           D
0   2  58  27   43.803848
1   1  68  27   38.803848
2   8  92  29  120.614835
3   7  93  22  111.809584
4   6  45  21   77.917424
.. ..  ..  ..         ...
95  6  48  37   77.917237
96  5  39  40   63.175445
97  3  62  20   56.527864
98  9  61  44  113.866750
99  9  84  42  125.519259

[100 rows x 4 columns]

Nah, kalo kita cuma pengen tau rata-rata per barisnya gimana? Apakah perlu se-ribet itu? Nggak pastinya. Kalau operasinya itu yang umum-umum saja, tidak usah pakai `apply lambda`.

In [124]:
df['rata-rata_abc'] = df[['A','B','C']].mean(axis = 1)

In [126]:
np.mean([2,58,27])

29.0

In [125]:
df

    A   B   C           D  rata-rata_abc
0   2  58  27   43.803848      29.000000
1   1  68  27   38.803848      32.000000
2   8  92  29  120.614835      43.000000
3   7  93  22  111.809584      40.666667
4   6  45  21   77.917424      24.000000
.. ..  ..  ..         ...            ...
95  6  48  37   77.917237      30.333333
96  5  39  40   63.175445      28.000000
97  3  62  20   56.527864      28.333333
98  9  61  44  113.866750      38.000000
99  9  84  42  125.519259      45.000000

[100 rows x 5 columns]

Next, bagaimana jika kita ingin melakukan pemetaan? Misalnya:
- Jika kolom A bernilai 1-3, kita beri label 'Kurang'
- Jika kolom A bernilai 4-7, kita beri label 'Cukup'
- Jika kolom A bernilai 8-10, kita beri label 'Surplus'

In [127]:
def label(a):
    if a<4:
        return 'Kurang'
    elif a<8:
        return 'Cukup'
    else:
        return 'Surplus'

In [128]:
df['label_A'] = df['A'].apply(label)

In [129]:
df

    A   B   C           D  rata-rata_abc  label_A
0   2  58  27   43.803848      29.000000   Kurang
1   1  68  27   38.803848      32.000000   Kurang
2   8  92  29  120.614835      43.000000  Surplus
3   7  93  22  111.809584      40.666667    Cukup
4   6  45  21   77.917424      24.000000    Cukup
.. ..  ..  ..         ...            ...      ...
95  6  48  37   77.917237      30.333333    Cukup
96  5  39  40   63.175445      28.000000    Cukup
97  3  62  20   56.527864      28.333333   Kurang
98  9  61  44  113.866750      38.000000  Surplus
99  9  84  42  125.519259      45.000000  Surplus

[100 rows x 6 columns]

Nah, selain `apply`, sebenarnya ada juga yang namanya pemetaan menggunakan dictionary. Contohnya:

In [134]:
warna_harga = {
    'Kuning':15000,
    'Hijau':10000,
    'Biru':11000
}

df_laporan = pd.DataFrame({
    'Warna':['Kuning', 'Kuning', 'Hijau', 'Kuning', 'Biru', 'Biru', 'Kuning', 'Hijau'],
    'Kuantitas':[10,10,20,15,8,20,12,18]
})

In [135]:
df_laporan

    Warna  Kuantitas
0  Kuning         10
1  Kuning         10
2   Hijau         20
3  Kuning         15
4    Biru          8
5    Biru         20
6  Kuning         12
7   Hijau         18

In [137]:
df_laporan['harga_satuan'] = df_laporan['Warna'].map(warna_harga)

In [139]:
df_laporan['total_harga'] = df_laporan['Kuantitas'] * df_laporan['harga_satuan']

In [140]:
df_laporan

    Warna  Kuantitas  harga_satuan  total_harga
0  Kuning         10         15000       150000
1  Kuning         10         15000       150000
2   Hijau         20         10000       200000
3  Kuning         15         15000       225000
4    Biru          8         11000        88000
5    Biru         20         11000       220000
6  Kuning         12         15000       180000
7   Hijau         18         10000       180000

### VI. Data Standardization

In [143]:
from sklearn import preprocessing

In [146]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [150]:
standardized_iris = pd.DataFrame(preprocessing.scale(iris[['sepal_length',
                                              'sepal_width',
                                              'petal_length',
                                              'petal_width']]))
standardized_iris['species'] = iris['species']

In [151]:
standardized_iris

            0         1         2         3    species
0   -0.900681  1.032057 -1.341272 -1.312977     setosa
1   -1.143017 -0.124958 -1.341272 -1.312977     setosa
2   -1.385353  0.337848 -1.398138 -1.312977     setosa
3   -1.506521  0.106445 -1.284407 -1.312977     setosa
4   -1.021849  1.263460 -1.341272 -1.312977     setosa
..        ...       ...       ...       ...        ...
145  1.038005 -0.124958  0.819624  1.447956  virginica
146  0.553333 -1.281972  0.705893  0.922064  virginica
147  0.795669 -0.124958  0.819624  1.053537  virginica
148  0.432165  0.800654  0.933356  1.447956  virginica
149  0.068662 -0.124958  0.762759  0.790591  virginica

[150 rows x 5 columns]